gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_serial.c
/****************************************************************************
 * arch/arm/src/ra6m5/ra6m5_serial.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <unistd.h>
#include <semaphore.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/fs/ioctl.h>
#include <nuttx/serial/serial.h>
#include <nuttx/power/pm.h>

#ifdef CONFIG_SERIAL_TERMIOS
#  include <termios.h>
#endif

#include <arch/board/board.h>

#include "chip.h"
#include "ra6m5_gpio.h"
#include "ra6m5_sci.h"
#ifdef SERIAL_HAVE_DMA
#  include "ra6m5_dma.h"
#endif
#include "ra6m5_rcc.h"
#include "arm_internal.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifdef USE_SERIALDRIVER
#ifdef HAVE_UART

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct ra6m5_serial_s
{
  struct uart_dev_s dev;       /* Generic UART device */
  uint8_t           ie;        /* Saved interrupt mask bits value */
  uint8_t           sr;        /* Saved status bits */

  /* Has been initialized and HW is setup. */

  bool              initialized;

#ifdef CONFIG_PM
  bool              suspended; /* UART device has been suspended. */

  /* Interrupt mask value stored before suspending for stop mode. */

  uint8_t           suspended_ie;
#endif

  /* If termios are supported, then the following fields may vary at
   * runtime.
   */

#ifdef CONFIG_SERIAL_TERMIOS
  uint8_t           parity;    /* 0=none, 1=odd, 2=even */
  uint8_t           bits;      /* Number of bits (7 or 8) */
  bool              stopbits2; /* True: Configure with 2 stop bits instead of 1 */
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  bool              iflow;     /* input flow control (RTS) enabled */
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
  bool              oflow;     /* output flow control (CTS) enabled */
#endif
  uint32_t          baud;      /* Configured baud */
#else
  const uint8_t     parity;    /* 0=none, 1=odd, 2=even */
  const uint8_t     bits;      /* Number of bits (7 or 8) */
  const bool        stopbits2; /* True: Configure with 2 stop bits instead of 1 */
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  const bool        iflow;     /* input flow control (RTS) enabled */
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
  const bool        oflow;     /* output flow control (CTS) enabled */
#endif
  const uint32_t    baud;      /* Configured baud */
#endif
  const uint8_t     irqrxi;    /* Receive data full IRQ */
  const uint8_t     irqtxi;    /* Transmit data empty IRQ */
  const uint8_t     irqtei;    /* Transmit end IRQ */
  const uint8_t     irqeri;    /* Receive error IRQ */
  uint32_t          clock;     /* Peripheral frequency */
  const uint32_t    base;      /* Base address of SCI registers */
  const uint32_t    tx_gpio;   /* U[S]ART TX GPIO pin configuration */
  const uint32_t    rx_gpio;   /* U[S]ART RX GPIO pin configuration */
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  const uint32_t    rts_gpio;  /* U[S]ART RTS GPIO pin configuration */
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
  const uint32_t    cts_gpio;  /* U[S]ART CTS GPIO pin configuration */
#endif

#ifdef SERIAL_HAVE_DMA
  const unsigned int rxdma_channel; /* DMA channel assigned */
#endif

  /* RX DMA state */

#ifdef SERIAL_HAVE_DMA
  DMA_HANDLE        rxdma;     /* currently-open receive DMA stream */
  bool              rxenable;  /* DMA-based reception en/disable */
#ifdef CONFIG_PM
  bool              rxdmasusp; /* Rx DMA suspended */
#endif
  uint32_t          rxdmanext; /* Next byte in the DMA buffer to be read */
  char       *const rxfifo;    /* Receive DMA buffer */
#endif

#ifdef HAVE_RS485
  const uint32_t    rs485_dir_gpio;     /* U[S]ART RS-485 DIR GPIO pin configuration */
  const bool        rs485_dir_polarity; /* U[S]ART RS-485 DIR pin state for TX enabled */
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

#ifndef CONFIG_SUPPRESS_UART_CONFIG
static void ra6m5serial_setformat(struct uart_dev_s *dev);
#endif
static int  ra6m5serial_setup(struct uart_dev_s *dev);
static void ra6m5serial_shutdown(struct uart_dev_s *dev);
static int  ra6m5serial_attach(struct uart_dev_s *dev);
static void ra6m5serial_detach(struct uart_dev_s *dev);
static int  ra6m5serial_interrupt(int irq, void *context,
                                    void *arg);
static int  ra6m5serial_ioctl(struct file *filep, int cmd,
                              unsigned long arg);
#ifndef SERIAL_HAVE_ONLY_DMA
static int  ra6m5serial_receive(struct uart_dev_s *dev,
                                unsigned int *status);
static void ra6m5serial_rxint(struct uart_dev_s *dev, bool enable);
static bool ra6m5serial_rxavailable(struct uart_dev_s *dev);
#endif
#ifdef CONFIG_SERIAL_IFLOWCONTROL
static bool ra6m5serial_rxflowcontrol(struct uart_dev_s *dev,
                                      unsigned int nbuffered, bool upper);
#endif
static void ra6m5serial_send(struct uart_dev_s *dev, int ch);
static void ra6m5serial_txint(struct uart_dev_s *dev, bool enable);
static bool ra6m5serial_txready(struct uart_dev_s *dev);

#ifdef SERIAL_HAVE_DMA
static int  ra6m5serial_dmasetup(struct uart_dev_s *dev);
static void ra6m5serial_dmashutdown(struct uart_dev_s *dev);
static int  ra6m5serial_dmareceive(struct uart_dev_s *dev,
                                   unsigned int *status);
static void ra6m5serial_dmareenable(struct ra6m5_serial_s *priv);
#ifdef CONFIG_SERIAL_IFLOWCONTROL
static bool ra6m5serial_dmaiflowrestart(struct ra6m5_serial_s *priv);
#endif
static void ra6m5serial_dmarxint(struct uart_dev_s *dev, bool enable);
static bool ra6m5serial_dmarxavailable(struct uart_dev_s *dev);

static void ra6m5serial_dmarxcallback(DMA_HANDLE handle, uint8_t status,
                                      void *arg);
#endif

