gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_serial.c
#ifdef CONFIG_PM
static void ra6m5serial_setsuspend(struct uart_dev_s *dev, bool suspend);
static void ra6m5serial_pm_setsuspend(bool suspend);
static void ra6m5serial_pmnotify(struct pm_callback_s *cb, int domain,
                                 enum pm_state_e pmstate);
static int  ra6m5serial_pmprepare(struct pm_callback_s *cb, int domain,
                                  enum pm_state_e pmstate);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Baud rate divisor information (UART mode) */
static const baud_setting_const_t g_async_baud[SCI_UART_NUM_DIVISORS_ASYNC] =
{
    {0U, 0U, 1U, 0U},                  /* BGDM, ABCS, ABCSE, n */
    {1U, 1U, 0U, 0U},
    {1U, 0U, 0U, 0U},
    {0U, 0U, 1U, 1U},
    {0U, 0U, 0U, 0U},
    {1U, 0U, 0U, 1U},
    {0U, 0U, 1U, 2U},
    {0U, 0U, 0U, 1U},
    {1U, 0U, 0U, 2U},
    {0U, 0U, 1U, 3U},
    {0U, 0U, 0U, 2U},
    {1U, 0U, 0U, 3U},
    {0U, 0U, 0U, 3U}
};

static const uint16_t g_div_coefficient[SCI_UART_NUM_DIVISORS_ASYNC] =
{
    6U,
    8U,
    16U,
    24U,
    32U,
    64U,
    96U,
    128U,
    256U,
    384U,
    512U,
    1024U,
    2048U,
};

#ifndef SERIAL_HAVE_ONLY_DMA
static const struct uart_ops_s g_sci_ops =
{
  .setup          = ra6m5serial_setup,
  .shutdown       = ra6m5serial_shutdown,
  .attach         = ra6m5serial_attach,
  .detach         = ra6m5serial_detach,
  .ioctl          = ra6m5serial_ioctl,
  .receive        = ra6m5serial_receive,
  .rxint          = ra6m5serial_rxint,
  .rxavailable    = ra6m5serial_rxavailable,
#  ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol  = ra6m5serial_rxflowcontrol,
#  endif
  .send           = ra6m5serial_send,
  .txint          = ra6m5serial_txint,
  .txready        = ra6m5serial_txready,
  .txempty        = ra6m5serial_txready,
};
#endif

#ifdef SERIAL_HAVE_DMA
static const struct uart_ops_s g_sci_dma_ops =
{
  .setup          = ra6m5serial_dmasetup,
  .shutdown       = ra6m5serial_dmashutdown,
  .attach         = ra6m5serial_attach,
  .detach         = ra6m5serial_detach,
  .ioctl          = ra6m5serial_ioctl,
  .receive        = ra6m5serial_dmareceive,
  .rxint          = ra6m5serial_dmarxint,
  .rxavailable    = ra6m5serial_dmarxavailable,
#  ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol  = ra6m5serial_rxflowcontrol,
#  endif
  .send           = ra6m5serial_send,
  .txint          = ra6m5serial_txint,
  .txready        = ra6m5serial_txready,
  .txempty        = ra6m5serial_txready,
};
#endif

/* I/O buffers */

#ifdef CONFIG_RA6M5_SCI0_UART
static char g_sci0rxbuffer[CONFIG_SCI0_RXBUFSIZE];
static char g_sci0txbuffer[CONFIG_SCI0_TXBUFSIZE];
#  ifdef CONFIG_SCI0_RXDMA
static char g_sci0rxfifo[RXDMA_BUFFER_SIZE];
#  endif
#endif

#ifdef CONFIG_RA6M5_SCI1_UART
static char g_sci1rxbuffer[CONFIG_SCI1_RXBUFSIZE];
static char g_sci1txbuffer[CONFIG_SCI1_TXBUFSIZE];
#  ifdef CONFIG_SCI1_RXDMA
static char g_sci1rxfifo[RXDMA_BUFFER_SIZE];
#  endif
#endif

#ifdef CONFIG_RA6M5_SCI2_UART
static char g_sci2rxbuffer[CONFIG_SCI2_RXBUFSIZE];
static char g_sci2txbuffer[CONFIG_SCI2_TXBUFSIZE];
#  ifdef CONFIG_SCI2_RXDMA
static char g_sci2rxfifo[RXDMA_BUFFER_SIZE];
#  endif
#endif

#ifdef CONFIG_RA6M5_SCI3_UART
static char g_sci3rxbuffer[CONFIG_SCI3_RXBUFSIZE];
static char g_sci3txbuffer[CONFIG_SCI3_TXBUFSIZE];
#  ifdef CONFIG_SCI3_RXDMA
static char g_sci3rxfifo[RXDMA_BUFFER_SIZE];
#  endif
#endif

#ifdef CONFIG_RA6M5_SCI4_UART
static char g_sci4rxbuffer[CONFIG_SCI4_RXBUFSIZE];
static char g_sci4txbuffer[CONFIG_SCI4_TXBUFSIZE];
#  ifdef CONFIG_SCI4_RXDMA
static char g_sci4rxfifo[RXDMA_BUFFER_SIZE];
#  endif
#endif

#ifdef CONFIG_RA6M5_SCI5_UART
static char g_sci5rxbuffer[CONFIG_SCI5_RXBUFSIZE];
static char g_sci5txbuffer[CONFIG_SCI5_TXBUFSIZE];
#  ifdef CONFIG_SCI5_RXDMA
static char g_sci5rxfifo[RXDMA_BUFFER_SIZE];
#  endif
#endif

#ifdef CONFIG_RA6M5_SCI6_UART
static char g_sci6rxbuffer[CONFIG_SCI6_RXBUFSIZE];
static char g_sci6txbuffer[CONFIG_SCI6_TXBUFSIZE];
#  ifdef CONFIG_SCI6_RXDMA
static char g_sci6rxfifo[RXDMA_BUFFER_SIZE];
#  endif
#endif

#ifdef CONFIG_RA6M5_SCI7_UART
static char g_sci7rxbuffer[CONFIG_SCI7_RXBUFSIZE];
static char g_sci7txbuffer[CONFIG_SCI7_TXBUFSIZE];
#  ifdef CONFIG_SCI7_RXDMA
static char g_sci7rxfifo[RXDMA_BUFFER_SIZE];
#  endif
#endif

#ifdef CONFIG_RA6M5_SCI8_UART
static char g_sci8rxbuffer[CONFIG_SCI8_RXBUFSIZE];
static char g_sci8txbuffer[CONFIG_SCI8_TXBUFSIZE];
#  ifdef CONFIG_SCI8_RXDMA
static char g_sci8rxfifo[RXDMA_BUFFER_SIZE];
#  endif
#endif

#ifdef CONFIG_RA6M5_SCI9_UART
static char g_sci9rxbuffer[CONFIG_SCI9_RXBUFSIZE];
static char g_sci9txbuffer[CONFIG_SCI9_TXBUFSIZE];
#  ifdef CONFIG_SCI9_RXDMA
static char g_sci9rxfifo[RXDMA_BUFFER_SIZE];
#  endif
#endif

/* This describes the state of the RA6M5 SCI0 port. */

#ifdef CONFIG_RA6M5_SCI0_UART
static struct ra6m5_serial_s g_sci0priv =
{
  .dev =
    {
#  if CONSOLE_UART == 0
      .isconsole = true,
#  endif
      .recv      =
      {
        .size    = CONFIG_SCI0_RXBUFSIZE,
        .buffer  = g_sci0rxbuffer,
      },
      .xmit      =
      {
        .size    = CONFIG_SCI0_TXBUFSIZE,
        .buffer  = g_sci0txbuffer,
      },
#  ifdef CONFIG_SCI0_RXDMA
      .ops       = &g_sci_dma_ops,
#  else
      .ops       = &g_sci_ops,
#  endif
      .priv      = &g_sci0priv,
    },

  .irqrxi        = RA6M5_IRQ_SCI0_RXI,
  .irqtxi        = RA6M5_IRQ_SCI0_TXI,
  .irqtei        = RA6M5_IRQ_SCI0_TEI,
  .irqeri        = RA6M5_IRQ_SCI0_ERI,
  .parity        = CONFIG_SCI0_PARITY,
  .bits          = CONFIG_SCI0_BITS,
  .stopbits2     = CONFIG_SCI0_2STOP,
  .baud          = CONFIG_SCI0_BAUD,
  .clock         = 0,
  .base          = RA6M5_SCI0_BASE,
  .tx_gpio       = GPIO_SCI0_TX,
  .rx_gpio       = GPIO_SCI0_RX,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_SCI0_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_SCI0_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_SCI0_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_SCI0_RTS,
#  endif
#  ifdef CONFIG_SCI0_RXDMA
  .rxdma_channel = DMAMAP_SCI0_RX,
  .rxfifo        = g_sci0rxfifo,
#  endif

#  ifdef CONFIG_SCI0_RS485
  .rs485_dir_gpio = GPIO_SCI0_RS485_DIR,
#    if (CONFIG_SCI0_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#    else
  .rs485_dir_polarity = true,
#    endif
#  endif
};
#endif

/* This describes the state of the RA6M5 SCI1 port. */

#ifdef CONFIG_RA6M5_SCI1_UART
static struct ra6m5_serial_s g_sci1priv =
{
  .dev =
    {
#  if CONSOLE_UART == 1
      .isconsole = true,
#  endif
      .recv      =
      {
        .size    = CONFIG_SCI1_RXBUFSIZE,
        .buffer  = g_sci1rxbuffer,
      },
      .xmit      =
      {
        .size    = CONFIG_SCI1_TXBUFSIZE,
        .buffer  = g_sci1txbuffer,
      },
#  ifdef CONFIG_SCI1_RXDMA
      .ops       = &g_sci_dma_ops,
#  else
      .ops       = &g_sci_ops,
#  endif
      .priv      = &g_sci1priv,
    },

  .irqrxi        = RA6M5_IRQ_SCI1_RXI,
  .irqtxi        = RA6M5_IRQ_SCI1_TXI,
  .irqtei        = RA6M5_IRQ_SCI1_TEI,
  .irqeri        = RA6M5_IRQ_SCI1_ERI,
  .parity        = CONFIG_SCI1_PARITY,
  .bits          = CONFIG_SCI1_BITS,
  .stopbits2     = CONFIG_SCI1_2STOP,
  .baud          = CONFIG_SCI1_BAUD,
  .clock         = 0,
  .base          = RA6M5_SCI1_BASE,
  .tx_gpio       = GPIO_SCI1_TX,
  .rx_gpio       = GPIO_SCI1_RX,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_SCI1_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_SCI1_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_SCI1_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_SCI1_RTS,
#  endif
#  ifdef CONFIG_SCI1_RXDMA
  .rxdma_channel = DMAMAP_SCI1_RX,
  .rxfifo        = g_sci1rxfifo,
#  endif

#  ifdef CONFIG_SCI1_RS485
  .rs485_dir_gpio = GPIO_SCI1_RS485_DIR,
#    if (CONFIG_SCI1_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#    else
  .rs485_dir_polarity = true,
#    endif
#  endif
};
#endif

