gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_serial.c
/* This describes the state of the RA6M5 SCI2 port. */

#ifdef CONFIG_RA6M5_SCI2_UART
static struct ra6m5_serial_s g_sci2priv =
{
  .dev =
    {
#  if CONSOLE_UART == 2
      .isconsole = true,
#  endif
      .recv      =
      {
        .size    = CONFIG_SCI2_RXBUFSIZE,
        .buffer  = g_sci2rxbuffer,
      },
      .xmit      =
      {
        .size    = CONFIG_SCI2_TXBUFSIZE,
        .buffer  = g_sci2txbuffer,
      },
#  ifdef CONFIG_SCI2_RXDMA
      .ops       = &g_sci_dma_ops,
#  else
      .ops       = &g_sci_ops,
#  endif
      .priv      = &g_sci2priv,
    },

  .irqrxi        = RA6M5_IRQ_SCI2_RXI,
  .irqtxi        = RA6M5_IRQ_SCI2_TXI,
  .irqtei        = RA6M5_IRQ_SCI2_TEI,
  .irqeri        = RA6M5_IRQ_SCI2_ERI,
  .parity        = CONFIG_SCI2_PARITY,
  .bits          = CONFIG_SCI2_BITS,
  .stopbits2     = CONFIG_SCI2_2STOP,
  .baud          = CONFIG_SCI2_BAUD,
  .clock         = 0,
  .base          = RA6M5_SCI2_BASE,
  .tx_gpio       = GPIO_SCI2_TX,
  .rx_gpio       = GPIO_SCI2_RX,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_SCI2_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_SCI2_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_SCI2_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_SCI2_RTS,
#  endif
#  ifdef CONFIG_SCI2_RXDMA
  .rxdma_channel = DMAMAP_SCI2_RX,
  .rxfifo        = g_sci2rxfifo,
#  endif

#  ifdef CONFIG_SCI2_RS485
  .rs485_dir_gpio = GPIO_SCI2_RS485_DIR,
#    if (CONFIG_SCI2_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#    else
  .rs485_dir_polarity = true,
#    endif
#  endif
};
#endif

/* This describes the state of the RA6M5 SCI3 port. */

#ifdef CONFIG_RA6M5_SCI3_UART
static struct ra6m5_serial_s g_sci3priv =
{
  .dev =
    {
#  if CONSOLE_UART == 3
      .isconsole = true,
#  endif
      .recv      =
      {
        .size    = CONFIG_SCI3_RXBUFSIZE,
        .buffer  = g_sci3rxbuffer,
      },
      .xmit      =
      {
        .size    = CONFIG_SCI3_TXBUFSIZE,
        .buffer  = g_sci3txbuffer,
      },
#  ifdef CONFIG_SCI3_RXDMA
      .ops       = &g_sci_dma_ops,
#  else
      .ops       = &g_sci_ops,
#  endif
      .priv      = &g_sci3priv,
    },

  .irqrxi        = RA6M5_IRQ_SCI3_RXI,
  .irqtxi        = RA6M5_IRQ_SCI3_TXI,
  .irqtei        = RA6M5_IRQ_SCI3_TEI,
  .irqeri        = RA6M5_IRQ_SCI3_ERI,
  .parity        = CONFIG_SCI3_PARITY,
  .bits          = CONFIG_SCI3_BITS,
  .stopbits2     = CONFIG_SCI3_2STOP,
  .baud          = CONFIG_SCI3_BAUD,
  .clock         = 0,
  .base          = RA6M5_SCI3_BASE,
  .tx_gpio       = GPIO_SCI3_TX,
  .rx_gpio       = GPIO_SCI3_RX,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_SCI3_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_SCI3_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_SCI3_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_SCI3_RTS,
#  endif
#  ifdef CONFIG_SCI3_RXDMA
  .rxdma_channel = DMAMAP_SCI3_RX,
  .rxfifo        = g_sci3rxfifo,
#  endif

#  ifdef CONFIG_SCI3_RS485
  .rs485_dir_gpio = GPIO_SCI3_RS485_DIR,
#    if (CONFIG_SCI3_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#    else
  .rs485_dir_polarity = true,
#    endif
#  endif
};
#endif

/* This describes the state of the RA6M5 SCI4 port. */

#ifdef CONFIG_RA6M5_SCI4_UART
static struct ra6m5_serial_s g_sci4priv =
{
  .dev =
    {
#  if CONSOLE_UART == 4
      .isconsole = true,
#  endif
      .recv      =
      {
        .size    = CONFIG_SCI4_RXBUFSIZE,
        .buffer  = g_sci4rxbuffer,
      },
      .xmit      =
      {
        .size    = CONFIG_SCI4_TXBUFSIZE,
        .buffer  = g_sci4txbuffer,
      },
#  ifdef CONFIG_SCI4_RXDMA
      .ops       = &g_sci_dma_ops,
#  else
      .ops       = &g_sci_ops,
#  endif
      .priv      = &g_sci4priv,
    },

  .irqrxi        = RA6M5_IRQ_SCI4_RXI,
  .irqtxi        = RA6M5_IRQ_SCI4_TXI,
  .irqtei        = RA6M5_IRQ_SCI4_TEI,
  .irqeri        = RA6M5_IRQ_SCI4_ERI,
  .parity        = CONFIG_SCI4_PARITY,
  .bits          = CONFIG_SCI4_BITS,
  .stopbits2     = CONFIG_SCI4_2STOP,
  .baud          = CONFIG_SCI4_BAUD,
  .clock         = 0,
  .base          = RA6M5_SCI4_BASE,
  .tx_gpio       = GPIO_SCI4_TX,
  .rx_gpio       = GPIO_SCI4_RX,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_SCI4_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_SCI4_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_SCI4_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_SCI4_RTS,
#  endif
#  ifdef CONFIG_SCI4_RXDMA
  .rxdma_channel = DMAMAP_SCI4_RX,
  .rxfifo        = g_sci4rxfifo,
#  endif

#  ifdef CONFIG_SCI4_RS485
  .rs485_dir_gpio = GPIO_SCI4_RS485_DIR,
#    if (CONFIG_SCI4_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#    else
  .rs485_dir_polarity = true,
#    endif
#  endif
};
#endif

/* This describes the state of the RA6M5 SCI5 port. */

#ifdef CONFIG_RA6M5_SCI5_UART
static struct ra6m5_serial_s g_sci5priv =
{
  .dev =
    {
#  if CONSOLE_UART == 5
      .isconsole = true,
#  endif
      .recv      =
      {
        .size    = CONFIG_SCI5_RXBUFSIZE,
        .buffer  = g_sci5rxbuffer,
      },
      .xmit      =
      {
        .size    = CONFIG_SCI5_TXBUFSIZE,
        .buffer  = g_sci5txbuffer,
      },
#  ifdef CONFIG_SCI5_RXDMA
      .ops       = &g_sci_dma_ops,
#  else
      .ops       = &g_sci_ops,
#  endif
      .priv      = &g_sci5priv,
    },

  .irqrxi        = RA6M5_IRQ_SCI5_RXI,
  .irqtxi        = RA6M5_IRQ_SCI5_TXI,
  .irqtei        = RA6M5_IRQ_SCI5_TEI,
  .irqeri        = RA6M5_IRQ_SCI5_ERI,
  .parity        = CONFIG_SCI5_PARITY,
  .bits          = CONFIG_SCI5_BITS,
  .stopbits2     = CONFIG_SCI5_2STOP,
  .baud          = CONFIG_SCI5_BAUD,
  .clock         = 0,
  .base          = RA6M5_SCI5_BASE,
  .tx_gpio       = GPIO_SCI5_TX,
  .rx_gpio       = GPIO_SCI5_RX,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_SCI5_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_SCI5_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_SCI5_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_SCI5_RTS,
#  endif
#  ifdef CONFIG_SCI5_RXDMA
  .rxdma_channel = DMAMAP_SCI5_RX,
  .rxfifo        = g_sci5rxfifo,
#  endif

#  ifdef CONFIG_SCI5_RS485
  .rs485_dir_gpio = GPIO_SCI5_RS485_DIR,
#    if (CONFIG_SCI5_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#    else
  .rs485_dir_polarity = true,
#    endif
#  endif
};
#endif

/* This describes the state of the RA6M5 SCI6 port. */

#ifdef CONFIG_RA6M5_SCI6_UART
static struct ra6m5_serial_s g_sci6priv =
{
  .dev =
    {
#  if CONSOLE_UART == 6
      .isconsole = true,
#  endif
      .recv      =
      {
        .size    = CONFIG_SCI6_RXBUFSIZE,
        .buffer  = g_sci6rxbuffer,
      },
      .xmit      =
      {
        .size    = CONFIG_SCI6_TXBUFSIZE,
        .buffer  = g_sci6txbuffer,
      },
#  ifdef CONFIG_SCI6_RXDMA
      .ops       = &g_sci_dma_ops,
#  else
      .ops       = &g_sci_ops,
#  endif
      .priv      = &g_sci6priv,
    },

  .irqrxi        = RA6M5_IRQ_SCI6_RXI,
  .irqtxi        = RA6M5_IRQ_SCI6_TXI,
  .irqtei        = RA6M5_IRQ_SCI6_TEI,
  .irqeri        = RA6M5_IRQ_SCI6_ERI,
  .parity        = CONFIG_SCI6_PARITY,
  .bits          = CONFIG_SCI6_BITS,
  .stopbits2     = CONFIG_SCI6_2STOP,
  .baud          = CONFIG_SCI6_BAUD,
  .clock         = 0,
  .base          = RA6M5_SCI6_BASE,
  .tx_gpio       = GPIO_SCI6_TX,
  .rx_gpio       = GPIO_SCI6_RX,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_SCI6_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_SCI6_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_SCI6_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_SCI6_RTS,
#  endif
#  ifdef CONFIG_SCI6_RXDMA
  .rxdma_channel = DMAMAP_SCI6_RX,
  .rxfifo        = g_sci6rxfifo,
#  endif

#  ifdef CONFIG_SCI6_RS485
  .rs485_dir_gpio = GPIO_SCI6_RS485_DIR,
#    if (CONFIG_SCI6_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#    else
  .rs485_dir_polarity = true,
#    endif
#  endif
};
#endif

