gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_serial.c
/* This describes the state of the RA6M5 SCI7 port. */

#ifdef CONFIG_RA6M5_SCI7_UART
static struct ra6m5_serial_s g_sci7priv =
{
  .dev =
    {
#  if CONSOLE_UART == 7
      .isconsole = true,
#  endif
      .recv      =
      {
        .size    = CONFIG_SCI7_RXBUFSIZE,
        .buffer  = g_sci7rxbuffer,
      },
      .xmit      =
      {
        .size    = CONFIG_SCI7_TXBUFSIZE,
        .buffer  = g_sci7txbuffer,
      },
#  ifdef CONFIG_SCI7_RXDMA
      .ops       = &g_sci_dma_ops,
#  else
      .ops       = &g_sci_ops,
#  endif
      .priv      = &g_sci7priv,
    },

  .irqrxi        = RA6M5_IRQ_SCI7_RXI,
  .irqtxi        = RA6M5_IRQ_SCI7_TXI,
  .irqtei        = RA6M5_IRQ_SCI7_TEI,
  .irqeri        = RA6M5_IRQ_SCI7_ERI,
  .parity        = CONFIG_SCI7_PARITY,
  .bits          = CONFIG_SCI7_BITS,
  .stopbits2     = CONFIG_SCI7_2STOP,
  .baud          = CONFIG_SCI7_BAUD,
  .clock         = 0,
  .base          = RA6M5_SCI7_BASE,
  .tx_gpio       = GPIO_SCI7_TX,
  .rx_gpio       = GPIO_SCI7_RX,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_SCI7_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_SCI7_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_SCI7_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_SCI7_RTS,
#  endif
#  ifdef CONFIG_SCI7_RXDMA
  .rxdma_channel = DMAMAP_SCI7_RX,
  .rxfifo        = g_sci7rxfifo,
#  endif

#  ifdef CONFIG_SCI7_RS485
  .rs485_dir_gpio = GPIO_SCI7_RS485_DIR,
#    if (CONFIG_SCI7_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#    else
  .rs485_dir_polarity = true,
#    endif
#  endif
};
#endif

/* This describes the state of the RA6M5 SCI8 port. */

#ifdef CONFIG_RA6M5_SCI8_UART
static struct ra6m5_serial_s g_sci8priv =
{
  .dev =
    {
#  if CONSOLE_UART == 8
      .isconsole = true,
#  endif
      .recv      =
      {
        .size    = CONFIG_SCI8_RXBUFSIZE,
        .buffer  = g_sci8rxbuffer,
      },
      .xmit      =
      {
        .size    = CONFIG_SCI8_TXBUFSIZE,
        .buffer  = g_sci8txbuffer,
      },
#  ifdef CONFIG_SCI8_RXDMA
      .ops       = &g_sci_dma_ops,
#  else
      .ops       = &g_sci_ops,
#  endif
      .priv      = &g_sci8priv,
    },

  .irqrxi        = RA6M5_IRQ_SCI8_RXI,
  .irqtxi        = RA6M5_IRQ_SCI8_TXI,
  .irqtei        = RA6M5_IRQ_SCI8_TEI,
  .irqeri        = RA6M5_IRQ_SCI8_ERI,
  .parity        = CONFIG_SCI8_PARITY,
  .bits          = CONFIG_SCI8_BITS,
  .stopbits2     = CONFIG_SCI8_2STOP,
  .baud          = CONFIG_SCI8_BAUD,
  .clock         = 0,
  .base          = RA6M5_SCI8_BASE,
  .tx_gpio       = GPIO_SCI8_TX,
  .rx_gpio       = GPIO_SCI8_RX,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_SCI8_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_SCI8_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_SCI8_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_SCI8_RTS,
#  endif
#  ifdef CONFIG_SCI8_RXDMA
  .rxdma_channel = DMAMAP_SCI8_RX,
  .rxfifo        = g_sci8rxfifo,
#  endif

#  ifdef CONFIG_SCI8_RS485
  .rs485_dir_gpio = GPIO_SCI8_RS485_DIR,
#    if (CONFIG_SCI8_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#    else
  .rs485_dir_polarity = true,
#    endif
#  endif
};
#endif

/* This describes the state of the RA6M5 SCI9 port. */

#ifdef CONFIG_RA6M5_SCI9_UART
static struct ra6m5_serial_s g_sci9priv =
{
  .dev =
    {
#  if CONSOLE_UART == 9
      .isconsole = true,
#  endif
      .recv      =
      {
        .size    = CONFIG_SCI9_RXBUFSIZE,
        .buffer  = g_sci9rxbuffer,
      },
      .xmit      =
      {
        .size    = CONFIG_SCI9_TXBUFSIZE,
        .buffer  = g_sci9txbuffer,
      },
#  ifdef CONFIG_SCI9_RXDMA
      .ops       = &g_sci_dma_ops,
#  else
      .ops       = &g_sci_ops,
#  endif
      .priv      = &g_sci9priv,
    },

  .irqrxi        = RA6M5_IRQ_SCI9_RXI,
  .irqtxi        = RA6M5_IRQ_SCI9_TXI,
  .irqtei        = RA6M5_IRQ_SCI9_TEI,
  .irqeri        = RA6M5_IRQ_SCI9_ERI,
  .parity        = CONFIG_SCI9_PARITY,
  .bits          = CONFIG_SCI9_BITS,
  .stopbits2     = CONFIG_SCI9_2STOP,
  .baud          = CONFIG_SCI9_BAUD,
  .clock         = 0,
  .base          = RA6M5_SCI9_BASE,
  .tx_gpio       = GPIO_SCI9_TX,
  .rx_gpio       = GPIO_SCI9_RX,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_SCI9_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_SCI9_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_SCI9_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_SCI9_RTS,
#  endif
#  ifdef CONFIG_SCI9_RXDMA
  .rxdma_channel = DMAMAP_SCI9_RX,
  .rxfifo        = g_sci9rxfifo,
#  endif

#  ifdef CONFIG_SCI9_RS485
  .rs485_dir_gpio = GPIO_SCI9_RS485_DIR,
#    if (CONFIG_SCI9_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#    else
  .rs485_dir_polarity = true,
#    endif
#  endif
};
#endif

/* This table lets us iterate over the configured SCIs */

static struct ra6m5_serial_s * const
  g_uart_devs[RA6M5_NSCI] =
{
#ifdef CONFIG_RA6M5_SCI0_UART
  [0] = &g_sci0priv,
#endif
#ifdef CONFIG_RA6M5_SCI1_UART
  [1] = &g_sci1priv,
#endif
#ifdef CONFIG_RA6M5_SCI2_UART
  [2] = &g_sci2priv,
#endif
#ifdef CONFIG_RA6M5_SCI3_UART
  [3] = &g_sci3priv,
#endif
#ifdef CONFIG_RA6M5_SCI4_UART
  [4] = &g_sci4priv,
#endif
#ifdef CONFIG_RA6M5_SCI5_UART
  [5] = &g_sci5priv,
#endif
#ifdef CONFIG_RA6M5_SCI6_UART
  [6] = &g_sci6priv,
#endif
#ifdef CONFIG_RA6M5_SCI7_UART
  [7] = &g_sci7priv,
#endif
#ifdef CONFIG_RA6M5_SCI8_UART
  [8] = &g_sci8priv,
#endif
#ifdef CONFIG_RA6M5_SCI9_UART
  [9] = &g_sci9priv,
#endif
};

#ifdef CONFIG_PM
struct serialpm_s
{
  struct pm_callback_s pm_cb;
  bool serial_suspended;
};

static struct serialpm_s g_serialpm =
{
  .pm_cb.notify  = ra6m5serial_pmnotify,
  .pm_cb.prepare = ra6m5serial_pmprepare,
  .serial_suspended = false
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: ra6m5serial_getreg8
 ****************************************************************************/

static inline 
uint8_t ra6m5serial_getreg8(struct ra6m5_serial_s *priv, int offset) {
  return getreg8(priv->base + offset);
}

static inline 
uint16_t ra6m5serial_getreg16(struct ra6m5_serial_s *priv, int offset) {
  return getreg16(priv->base + offset);
}

static inline 
uint32_t ra6m5serial_getreg32(struct ra6m5_serial_s *priv, int offset) {
  return getreg32(priv->base + offset);
}

/****************************************************************************
 * Name: ra6m5serial_putreg8
 ****************************************************************************/

static inline
void ra6m5serial_putreg8(struct ra6m5_serial_s *priv,
                         int offset, uint8_t value)
{
  putreg8(value, priv->base + offset);
}

static inline
void ra6m5serial_putreg16(struct ra6m5_serial_s *priv,
                          int offset, uint16_t value)
{
  putreg16(value, priv->base + offset);
}

static inline
void ra6m5serial_putreg32(struct ra6m5_serial_s *priv,
                          int offset, uint32_t value)
{
  putreg32(value, priv->base + offset);
}

/****************************************************************************
 * Name: ra6m5serial_setusartint
 ****************************************************************************/

static inline
void ra6m5serial_setusartint(struct ra6m5_serial_s *priv,
                             uint8_t ie)
{
  uint8_t regval;

  /* Save the interrupt mask */

