gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_serial.c
  priv->ie = ie;

  /* And restore the interrupt state (see the interrupt enable/usage table
   * above)
   */

  regval = ra6m5serial_getreg8(priv, RA6M5_SCI_SCR_OFFSET);
  regval &= ~(SCI_SCR_USED_INTS);
  regval |= (ie & (SCI_SCR_USED_INTS));
  ra6m5serial_putreg8(priv, RA6M5_SCI_SCR_OFFSET, regval);
}

/****************************************************************************
 * Name: ra6m5serial_restoreusartint
 ****************************************************************************/

static void ra6m5serial_restoreusartint(struct ra6m5_serial_s *priv,
                                        uint8_t ie)
{
  irqstate_t flags;

  flags = enter_critical_section();

  ra6m5serial_setusartint(priv, ie);

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: ra6m5serial_disableusartint
 ****************************************************************************/

static void ra6m5serial_disableusartint(struct ra6m5_serial_s *priv,
                                        uint8_t *ie)
{
  irqstate_t flags;

  flags = enter_critical_section();

  if (ie)
    {
      uint8_t scr;

      /* SCI interrupts:
       *
       * Enable           Status          Meaning
       * ---------------- -------------- ----------------------
       * SCI_SCR_RIE      SCI_SSR_RDRF    Received Data Full
       * SCI_SCR_TIE      SCI_SSR_TDRE    Transmit Data Empty
       * SCI_SCR_TEIE     SCI_SSR_TEND    Transmission End  (only RS-485)
       */

      scr = ra6m5serial_getreg8(priv, RA6M5_SCI_SCR_OFFSET);

      /* Return the current interrupt mask value for the used interrupts.
       * Notice that this depends on the fact that none of the used interrupt
       * enable bits overlap.  This logic would fail if we needed the break
       * interrupt!
       */

      *ie = scr & (SCI_SCR_USED_INTS);
    }

  /* Disable all interrupts */

  ra6m5serial_setusartint(priv, 0);

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: ra6m5serial_dmanextrx
 *
 * Description:
 *   Returns the index into the RX FIFO where the DMA will place the next
 *   byte that it receives.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_DMA
static int ra6m5serial_dmanextrx(struct ra6m5_serial_s *priv)
{
  size_t dmaresidual;

  dmaresidual = ra6m5_dmaresidual(priv->rxdma);

  return (RXDMA_BUFFER_SIZE - (int)dmaresidual);
}
#endif

/****************************************************************************
 * Name: ra6m5serial_setformat
 *
 * Description:
 *   Set the serial line format and speed.
 *
 ****************************************************************************/

#ifndef CONFIG_SUPPRESS_UART_CONFIG
static void ra6m5serial_setformat(struct uart_dev_s *dev)
{
  struct ra6m5_serial_s *priv =
    (struct ra6m5_serial_s *)dev->priv;
  uint8_t regval;

  /* Find the best BRR (bit rate register) value.
    *  In table g_async_baud, divisor values are stored for BGDM, ABCS, ABCSE and N values.  Each set of divisors
    *  is tried, and the settings with the lowest bit rate error are stored. The formula to calculate BRR is as
    *  follows and it must be 255 or less:
    *  BRR = (PCLK / (div_coefficient * baud)) - 1
    */
  static const int32_t  SCI_UART_100_PERCENT_X_1000 = 100000;
  static const int32_t  SCI_UART_MDDR_DIVISOR       = 256;
  static const uint32_t baud_rate_error_x_1000      = 5000;
  static const bool     bitrate_modulation          = false;

  int32_t  hit_bit_err = SCI_UART_100_PERCENT_X_1000;
  uint32_t hit_mddr    = 0U;
  uint32_t divisor     = 0U;
  uint32_t freq_hz     = priv->clock;

  uint8_t reg_brr  = SCI_UART_BRR_MAX;
  uint8_t reg_mddr = SCI_UART_MDDR_MIN;
  uint8_t reg_semr = ra6m5serial_getreg8(priv, RA6M5_SCI_SEMR_OFFSET) & 0xA3;
  uint8_t reg_scr  = ra6m5serial_getreg8(priv, RA6M5_SCI_SCR_OFFSET)  & 0x03;

  for (uint32_t select_16_base_clk_cycles = 0U;
        select_16_base_clk_cycles <= 1U && (hit_bit_err > ((int32_t) baud_rate_error_x_1000));
        select_16_base_clk_cycles++)
  {
      for (uint32_t i = 0U; i < SCI_UART_NUM_DIVISORS_ASYNC; i++)
      {
          /* if select_16_base_clk_cycles == true:  Skip this calculation for divisors that are not acheivable with 16 base clk cycles per bit.
            *  if select_16_base_clk_cycles == false: Skip this calculation for divisors that are only acheivable without 16 base clk cycles per bit.
            */
          if (((uint8_t) select_16_base_clk_cycles) ^ (g_async_baud[i].abcs | g_async_baud[i].abcse))
          {
              continue;
          }

          divisor = (uint32_t) g_div_coefficient[i] * priv->baud;
          uint32_t temp_brr = freq_hz / divisor;

          if (temp_brr <= (SCI_UART_BRR_MAX + 1U))
          {
              while (temp_brr > 0U)
              {
                  temp_brr -= 1U;

                  /* Calculate the bit rate error. The formula is as follows:
                    *  bit rate error[%] = {(PCLK / (baud * div_coefficient * (BRR + 1)) - 1} x 100
                    *  calculates bit rate error[%] to three decimal places
                    */
                  int32_t err_divisor = (int32_t) (divisor * (temp_brr + 1U));

                  /* Promoting to 64 bits for calculation, but the final value can never be more than 32 bits, as
                    * described below, so this cast is safe.
                    *    1. (temp_brr + 1) can be off by an upper limit of 1 due to rounding from the calculation:
                    *       freq_hz / divisor, or:
                    *       freq_hz / divisor <= (temp_brr + 1) < (freq_hz / divisor) + 1
                    *    2. Solving for err_divisor:
                    *       freq_hz <= err_divisor < freq_hz + divisor
                    *    3. Solving for bit_err:
                    *       0 >= bit_err >= (freq_hz * 100000 / (freq_hz + divisor)) - 100000
                    *    4. freq_hz >= divisor (or temp_brr would be -1 and we would never enter this while loop), so:
                    *       0 >= bit_err >= 100000 / freq_hz - 100000
                    *    5. Larger frequencies yield larger bit errors (absolute value).  As the frequency grows,
                    *       the bit_err approaches -100000, so:
                    *       0 >= bit_err >= -100000
                    *    6. bit_err is between -100000 and 0.  This entire range fits in an int32_t type, so the cast
                    *       to (int32_t) is safe.
                    */
                  int32_t bit_err = (int32_t) (((((int64_t) freq_hz) * SCI_UART_100_PERCENT_X_1000) /
                                                err_divisor) - SCI_UART_100_PERCENT_X_1000);

                  reg_mddr = 0U;
                  if (bitrate_modulation)
                  {
                      /* Calculate the MDDR (M) value if bit rate modulation is enabled,
                        * The formula to calculate MBBR (from the M and N relationship given in the hardware manual) is as follows
                        * and it must be between 128 and 256.
                        * MDDR = ((div_coefficient * baud * 256) * (BRR + 1)) / PCLK */
                      reg_mddr = (uint32_t) err_divisor / (freq_hz / 128);

                      /* The maximum value that could result from the calculation above is 256, which is a valid MDDR
                        * value, so only the lower bound is checked. */
                      if (reg_mddr < SCI_UART_MDDR_MIN)
                      {
                          break;
                      }

                      /* Adjust bit rate error for bit rate modulation. The following formula is used:
                        *  bit rate error [%] = ((bit rate error [%, no modulation] + 100) * MDDR / 256) - 100
                        */
                      bit_err = (((bit_err + SCI_UART_100_PERCENT_X_1000) * (int32_t) reg_mddr) /
                                  SCI_UART_MDDR_DIVISOR) - SCI_UART_100_PERCENT_X_1000;
                  }

                  /* Take the absolute value of the bit rate error. */
                  if (bit_err < 0)
                  {
                      bit_err = -bit_err;
                  }

                  /* If the absolute value of the bit rate error is less than the previous lowest absolute value of
                    *  bit rate error, then store these settings as the best value.
                    */
                  if (bit_err < hit_bit_err)
                  {
                      reg_semr |= g_async_baud[i].bgdm  << 6;
                      reg_semr |= g_async_baud[i].abcs  << 4;
                      reg_semr |= g_async_baud[i].abcse << 3;
                      reg_scr  |= g_async_baud[i].cks;
                      reg_brr   = (uint8_t) temp_brr;
                      hit_bit_err = bit_err;
                      hit_mddr    = reg_mddr;
                  }

                  if (bitrate_modulation)
                  {
                      reg_semr |= 1 << 2;
                      reg_mddr = (uint8_t) hit_mddr;
                  }
                  else
                  {
                      break;
                  }
              }
          }
      }
  }

