gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_serial.c
  ra6m5serial_putreg8(priv, RA6M5_SCI_MDDR_OFFSET, reg_mddr);
  ra6m5serial_putreg8(priv, RA6M5_SCI_SEMR_OFFSET, reg_semr);
  ra6m5serial_putreg8(priv, RA6M5_SCI_SCR_OFFSET,  reg_scr);
  ra6m5serial_putreg8(priv, RA6M5_SCI_BRR_OFFSET,  reg_brr);

  /* Configure parity mode */

  regval  = ra6m5serial_getreg8(priv, RA6M5_SCI_SMR_OFFSET);
  regval &= ~(SCI_SMR_PM | SCI_SMR_PE | SCI_SMR_STOP | SCI_SMR_CHR);

  if (priv->parity == 1)       /* Odd parity */
    {
      regval |= (SCI_SMR_PE | SCI_SMR_PM);
    }
  else if (priv->parity == 2)  /* Even parity */
    {
      regval |= SCI_SMR_PE;
    }

  /* Configure word length (parity uses one of configured bits)
   *
   * Default: 1 start, 8 data (no parity), n stop, OR
   *          1 start, 7 data + parity, n stop
   */

  if (priv->bits == 9 || (priv->bits == 8 && priv->parity != 0))
    {
      /* Select: 1 start, 8 data + parity, n stop, OR
       *         1 start, 9 data (no parity), n stop.
       */

      regval |= SCI_SMR_CHR;
    }
  else if (priv->bits == 7 && priv->parity == 0)
    {
      /* Select: 1 start, 7 data (no parity), n stop, OR
       */
      uint32_t scmr;

      scmr  = ra6m5serial_getreg8(priv, RA6M5_SCI_SCMR_OFFSET);
      scmr |= SCI_SCMR_CHR1;
      ra6m5serial_putreg8(priv, RA6M5_SCI_SCMR_OFFSET, scmr);
    }

  /* Configure STOP bits */

  if (priv->stopbits2)
    {
      regval |= SCI_SMR_STOP;
    }

  ra6m5serial_putreg8(priv, RA6M5_SCI_SMR_OFFSET, regval);

  /* Configure hardware flow control */

  regval  = ra6m5serial_getreg8(priv, RA6M5_SCI_SPMR_OFFSET);
  regval &= ~(SCI_SPMR_CTSE | SCI_SPMR_CSTPEN);

#if defined(CONFIG_SERIAL_IFLOWCONTROL) && !defined(CONFIG_RA6M5_FLOWCONTROL_BROKEN)
  if (priv->iflow && (priv->rts_gpio != 0))
    {

    }
#endif

#ifdef CONFIG_SERIAL_OFLOWCONTROL
  if (priv->oflow && (priv->cts_gpio != 0))
    {
      regval |= SCI_SPMR_CTSE;
    }
#endif

  ra6m5serial_putreg8(priv, RA6M5_SCI_SPMR_OFFSET, regval);
}
#endif /* CONFIG_SUPPRESS_UART_CONFIG */

/****************************************************************************
 * Name: ra6m5serial_setsuspend
 *
 * Description:
 *   Suspend or resume serial peripheral.
 *
 ****************************************************************************/

#ifdef CONFIG_PM
static void ra6m5serial_setsuspend(struct uart_dev_s *dev, bool suspend)
{
  struct ra6m5_serial_s *priv = (struct ra6m5_serial_s *)dev->priv;
#ifdef SERIAL_HAVE_DMA
  bool dmarestored = false;
#endif

  if (priv->suspended == suspend)
    {
      return;
    }

  priv->suspended = suspend;

  if (suspend)
    {
#ifdef CONFIG_SERIAL_IFLOWCONTROL
      if (priv->iflow)
        {
          /* Force RTS high to prevent further Rx. */

          ra6m5_configgpio((priv->rts_gpio & ~GPIO_MODE_MASK)
                             | (GPIO_OUTPUT | GPIO_OUTPUT_SET));
        }
#endif

      /* Disable interrupts to prevent Tx. */

      ra6m5serial_disableusartint(priv, &priv->suspended_ie);

      /* Wait last Tx to complete. */

      while ((ra6m5serial_getreg8(priv, RA6M5_SCI_SSR_OFFSET) &
              SCI_SSR_TEND) == 0);

#ifdef SERIAL_HAVE_DMA
      if (priv->dev.ops == &g_sci_dma_ops && !priv->rxdmasusp)
        {
#ifdef CONFIG_SERIAL_IFLOWCONTROL
          if (priv->iflow && priv->rxdmanext == RXDMA_BUFFER_SIZE)
            {
              /* Rx DMA in non-circular iflow mode and already stopped
               * at end of DMA buffer. No need to suspend.
               */
            }
          else
#endif
            {
              /* Suspend Rx DMA. */

              ra6m5_dmastop(priv->rxdma);
              priv->rxdmasusp = true;
            }
        }
#endif
    }
  else
    {
#ifdef SERIAL_HAVE_DMA
      if (priv->dev.ops == &g_sci_dma_ops && priv->rxdmasusp)
        {
#ifdef CONFIG_SERIAL_IFLOWCONTROL
          if (priv->iflow)
            {
              ra6m5serial_dmaiflowrestart(priv);
            }
          else
#endif
            {
              /* This SCI does not have HW flow-control. Unconditionally
               * re-enable DMA (might loss unprocessed bytes received
               * to DMA buffer before suspending).
               */

              ra6m5serial_dmareenable(priv);
              priv->rxdmasusp = false;
            }

          dmarestored = true;
        }
#endif

      /* Re-enable interrupts to resume Tx. */

      ra6m5serial_restoreusartint(priv, priv->suspended_ie);

#ifdef CONFIG_SERIAL_IFLOWCONTROL
      if (priv->iflow)
        {
          /* Restore peripheral RTS control. */

          ra6m5_configgpio(priv->rts_gpio);
        }
#endif
    }

#ifdef SERIAL_HAVE_DMA
  if (dmarestored)
    {
      irqstate_t flags;

      flags = enter_critical_section();

      /* Perform initial Rx DMA buffer fetch to wake-up serial device
       * activity.
       */

      if (priv->rxdma != NULL)
        {
          ra6m5serial_dmarxcallback(priv->rxdma, 0, priv);
        }

      leave_critical_section(flags);
    }
#endif
}
#endif

/****************************************************************************
 * Name: ra6m5serial_pm_setsuspend
 *
 * Description:
 *   Suspend or resume serial peripherals for/from deep-sleep/stop modes.
 *
 ****************************************************************************/

#ifdef CONFIG_PM
static void ra6m5serial_pm_setsuspend(bool suspend)
{
  int n;

  /* Already in desired state? */

  if (suspend == g_serialpm.serial_suspended)
    return;

  g_serialpm.serial_suspended = suspend;

  for (n = 0; n < RA6M5_NLPUART + RA6M5_NSCI + RA6M5_NUART; n++)
    {
      struct ra6m5_serial_s *priv = g_uart_devs[n];

      if (!priv || !priv->initialized)
        {
          continue;
        }

      ra6m5serial_setsuspend(&priv->dev, suspend);
    }
}
#endif

/****************************************************************************
 * Name: ra6m5serial_setclock
 *
 * Description:
 *   Enable or disable clock for the SCI peripheral
 *
 * Input Parameters:
 *   dev - A reference to the UART driver state structure
 *   on  - Enable clock if 'on' is 'true' and disable if 'false'
 *
 ****************************************************************************/

static void ra6m5serial_setclock(struct uart_dev_s *dev, bool on)
{
  struct ra6m5_serial_s *priv =
    (struct ra6m5_serial_s *)dev->priv;
  uint32_t addr = RA6M5_MSTP_REG(RA6M5_MSTP_MSTPCRB_OFFSET);
  uint32_t mask;

  /* Update the peripheral clock frequency */

  priv->clock = g_clock_freq[RA6M5_CLOCKS_SOURCE_PCLKA];

  /* Determine which SCI to configure */

