gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_serial.c
  switch (priv->base)
    {
    default:
      return;
#ifdef CONFIG_RA6M5_SCI0_UART
    case RA6M5_SCI0_BASE:
      mask = RA6M5_SCI_STOP(0);
      break;
#endif
#ifdef CONFIG_RA6M5_SCI1_UART
    case RA6M5_SCI1_BASE:
      mask = RA6M5_SCI_STOP(1);
      break;
#endif
#ifdef CONFIG_RA6M5_SCI2_UART
    case RA6M5_SCI2_BASE:
      mask = RA6M5_SCI_STOP(2);
      break;
#endif
#ifdef CONFIG_RA6M5_SCI3_UART
    case RA6M5_SCI3_BASE:
      mask = RA6M5_SCI_STOP(3);
      break;
#endif
#ifdef CONFIG_RA6M5_SCI4_UART
    case RA6M5_SCI4_BASE:
      mask = RA6M5_SCI_STOP(4);
      break;
#endif
#ifdef CONFIG_RA6M5_SCI5_UART
    case RA6M5_SCI5_BASE:
      mask = RA6M5_SCI_STOP(5);
      break;
#endif
#ifdef CONFIG_RA6M5_SCI8_UART
    case RA6M5_SCI8_BASE:
      mask = RA6M5_SCI_STOP(8);
      break;
#endif
    }

  /* Enable/disable clock for SCI */

  if (on)
    {
      modifyreg32(addr, mask, 0);
    }
  else
    {
      modifyreg32(addr, 0, mask);
    }
}

/****************************************************************************
 * Name: ra6m5serial_setup
 *
 * Description:
 *   Configure the SCI baud, bits, parity, etc. This method is called the
 *   first time that the serial port is opened.
 *
 ****************************************************************************/

static int ra6m5serial_setup(struct uart_dev_s *dev)
{
  struct ra6m5_serial_s *priv =
    (struct ra6m5_serial_s *)dev->priv;

#ifndef CONFIG_SUPPRESS_UART_CONFIG
  uint8_t scr;
  uint8_t smr;

  /* Note: The logic here depends on the fact that that the SCI module
   * was enabled in ra6m5_lowsetup().
   */

  /* Enable SCI clock */

  ra6m5serial_setclock(dev, true);

  /* Configure pins for SCI use */

  ra6m5_configgpio(priv->tx_gpio);
  ra6m5_configgpio(priv->rx_gpio);

#ifdef CONFIG_SERIAL_OFLOWCONTROL
  if (priv->cts_gpio != 0)
    {
      ra6m5_configgpio(priv->cts_gpio);
    }
#endif

#ifdef CONFIG_SERIAL_IFLOWCONTROL
  if (priv->rts_gpio != 0)
    {
      uint32_t config = priv->rts_gpio;

#ifdef CONFIG_RA6M5_FLOWCONTROL_BROKEN
      /* Instead of letting hw manage this pin, we will bitbang */

      config = (config & ~GPIO_MODE_MASK) | GPIO_OUTPUT;

#endif
      ra6m5_configgpio(config);
    }
#endif

#ifdef HAVE_RS485
  if (priv->rs485_dir_gpio != 0)
    {
      ra6m5_configgpio(priv->rs485_dir_gpio);
      ra6m5_gpiowrite(priv->rs485_dir_gpio, !priv->rs485_dir_polarity);
    }
#endif

  /* Configure SCR */

  scr  = ra6m5serial_getreg8(priv, RA6M5_SCI_SCR_OFFSET);
  scr &= ~(SCI_SCR_USED_INTS | SCI_SCR_RE | SCI_SCR_TE);
  ra6m5serial_putreg8(priv, RA6M5_SCI_SCR_OFFSET, scr);

  /* Configure SMR */

  smr  = ra6m5serial_getreg8(priv, RA6M5_SCI_SMR_OFFSET);
  smr &= ~(SCI_SMR_MP | SCI_SMR_STOP | SCI_SMR_PM | SCI_SMR_PE | 
           SCI_SMR_CHR | SCI_SMR_CM);

  /* Configure STOP bits */

  if (priv->stopbits2)
    {
      smr |= SCI_SMR_STOP;
    }

  ra6m5serial_putreg8(priv, RA6M5_SCI_SMR_OFFSET, smr);

  /* Configure the SCI line format and speed. */

  ra6m5serial_setformat(dev);

  /* Enable Rx, Tx, and the SCI */

  scr |= (SCI_SCR_RE | SCI_SCR_TE);
  ra6m5serial_putreg8(priv, RA6M5_SCI_SCR_OFFSET, scr);

#endif /* CONFIG_SUPPRESS_UART_CONFIG */

  /* Set up the cached interrupt enables value */

  priv->ie = 0;

  /* Mark device as initialized. */

  priv->initialized = true;

  return OK;
}

/****************************************************************************
 * Name: ra6m5serial_dmasetup
 *
 * Description:
 *   Configure the SCI baud, bits, parity, etc. This method is called the
 *   first time that the serial port is opened.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_DMA
static int ra6m5serial_dmasetup(struct uart_dev_s *dev)
{
  struct ra6m5_serial_s *priv =
    (struct ra6m5_serial_s *)dev->priv;
  int result;
  uint32_t regval;

  /* Do the basic UART setup first, unless we are the console */

  if (!dev->isconsole)
    {
      result = ra6m5serial_setup(dev);
      if (result != OK)
        {
          return result;
        }
    }

  /* Acquire the DMA channel.  This should always succeed. */

  priv->rxdma = ra6m5_dmachannel(priv->rxdma_channel);

#ifdef CONFIG_SERIAL_IFLOWCONTROL
  if (priv->iflow)
    {
      /* Configure for non-circular DMA reception into the RX FIFO */

      ra6m5_dmasetup(priv->rxdma,
                     priv->base + RA6M5_SCI_RDR_OFFSET,
                     (uint32_t)priv->rxfifo,
                     RXDMA_BUFFER_SIZE,
                     SERIAL_DMA_IFLOW_CONTROL_WORD);
    }
  else
#endif
    {
      /* Configure for circular DMA reception into the RX FIFO */

      ra6m5_dmasetup(priv->rxdma,
                     priv->base + RA6M5_SCI_RDR_OFFSET,
                     (uint32_t)priv->rxfifo,
                     RXDMA_BUFFER_SIZE,
                     SERIAL_DMA_CONTROL_WORD);
    }

  /* Reset our DMA shadow pointer to match the address just
   * programmed above.
   */

  priv->rxdmanext = 0;

  /* Enable receive DMA for the UART */

  regval  = ra6m5serial_getreg8(priv, RA6M5_SCI_CR3_OFFSET);
  regval |= SCI_CR3_DMAR;
  ra6m5serial_putreg8(priv, RA6M5_SCI_CR3_OFFSET, regval);

#ifdef CONFIG_SERIAL_IFLOWCONTROL
  if (priv->iflow)
    {
      /* Start the DMA channel, and arrange for callbacks at the full point
       * in the FIFO. After buffer gets full, hardware flow-control kicks
       * in and DMA transfer is stopped.
       */

      ra6m5_dmastart(priv->rxdma, ra6m5serial_dmarxcallback,
                       (void *)priv, false);
    }
  else
#endif
    {
      /* Start the DMA channel, and arrange for callbacks at the half and
       * full points in the FIFO.  This ensures that we have half a FIFO
       * worth of time to claim bytes before they are overwritten.
       */

      ra6m5_dmastart(priv->rxdma, ra6m5serial_dmarxcallback,
                       (void *)priv, true);
    }

  return OK;
}
#endif

/****************************************************************************
 * Name: ra6m5serial_shutdown
 *
 * Description:
 *   Disable the SCI.  This method is called when the serial
 *   port is closed
 *
 ****************************************************************************/

