gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_serial.c
static void ra6m5serial_shutdown(struct uart_dev_s *dev)
{
  struct ra6m5_serial_s *priv =
    (struct ra6m5_serial_s *)dev->priv;
  uint8_t regval;

  /* Mark device as uninitialized. */

  priv->initialized = false;

  /* Disable all interrupts */

  ra6m5serial_disableusartint(priv, NULL);

  /* Disable SCI clock */

  ra6m5serial_setclock(dev, false);

  /* Disable Rx, Tx, and the UART */

  regval  = ra6m5serial_getreg8(priv, RA6M5_SCI_SCR_OFFSET);
  regval &= ~(SCI_SCR_RE | SCI_SCR_TE);
  ra6m5serial_putreg8(priv, RA6M5_SCI_SCR_OFFSET, regval);

  /* Release pins. "If the serial-attached device is powered down, the TX
   * pin causes back-powering, potentially confusing the device to the point
   * of complete lock-up."
   *
   * REVISIT:  Is unconfiguring the pins appropriate for all device?  If not,
   * then this may need to be a configuration option.
   */

  ra6m5_unconfiggpio(priv->tx_gpio);
  ra6m5_unconfiggpio(priv->rx_gpio);

#ifdef CONFIG_SERIAL_OFLOWCONTROL
  if (priv->cts_gpio != 0)
    {
      ra6m5_unconfiggpio(priv->cts_gpio);
    }
#endif

#ifdef CONFIG_SERIAL_IFLOWCONTROL
  if (priv->rts_gpio != 0)
    {
      ra6m5_unconfiggpio(priv->rts_gpio);
    }
#endif

#ifdef HAVE_RS485
  if (priv->rs485_dir_gpio != 0)
    {
      ra6m5_unconfiggpio(priv->rs485_dir_gpio);
    }
#endif
}

/****************************************************************************
 * Name: ra6m5serial_dmashutdown
 *
 * Description:
 *   Disable the SCI.  This method is called when the serial
 *   port is closed
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_DMA
static void ra6m5serial_dmashutdown(struct uart_dev_s *dev)
{
  struct ra6m5_serial_s *priv =
    (struct ra6m5_serial_s *)dev->priv;

  /* Perform the normal UART shutdown */

  ra6m5serial_shutdown(dev);

  /* Stop the DMA channel */

  ra6m5_dmastop(priv->rxdma);

  /* Release the DMA channel */

  ra6m5_dmafree(priv->rxdma);
  priv->rxdma = NULL;
}
#endif

/****************************************************************************
 * Name: ra6m5serial_attach
 *
 * Description:
 *   Configure the SCI to operation in interrupt driven mode.  This method
 *   is called when the serial port is opened.  Normally, this is just after
 *   the setup() method is called, however, the serial console may operate in
 *   a non-interrupt driven mode during the boot phase.
 *
 *   RX and TX interrupts are not enabled when by the attach method (unless
 *   the hardware supports multiple levels of interrupt enabling).  The RX
 *   and TX interrupts are not enabled until the txint() and rxint() methods
 *   are called.
 *
 ****************************************************************************/

static int ra6m5serial_attach(struct uart_dev_s *dev)
{
  struct ra6m5_serial_s *priv =
    (struct ra6m5_serial_s *)dev->priv;
  int ret;

  /* Attach the RDR full IRQ (RXI) that is enabled by the RIE SCR bit */

  ret = irq_attach(priv->irqrxi, ra6m5serial_interrupt, dev);
  if (OK != ret)
    {
      return ret;
    }

  /* Attach the TDR empty IRQ (TXI) enabled by the TIE SCR bit */

  ret = irq_attach(priv->irqtxi, ra6m5serial_interrupt, dev);
  if (OK != ret)
    {
      return ret;
    }

  /* Attach the ERI IRQ */

  ret = irq_attach(priv->irqeri, ra6m5serial_interrupt, dev);
  if (OK != ret)
    {
      return ret;
    }

  /* Attach the TEI IRQ */

  ret = irq_attach(priv->irqtei, ra6m5serial_interrupt, dev);
  if (OK == ret)
    {
#ifdef CONFIG_ARCH_IRQPRIO
      /* All SCI0 interrupts share the same prioritization */

      up_prioritize_irq(priv->irqrxi, 7);  /* Set SCI priority midway */
      up_prioritize_irq(priv->irqtxi, 7);
#endif

      /* Enable the interrupts */

      up_enable_irq(priv->irqrxi);
      up_enable_irq(priv->irqtxi);
      up_enable_irq(priv->irqtei);
      up_enable_irq(priv->irqeri);

      /* Return OK on success */

      return OK;
    }

  irq_detach(priv->irqrxi);
  irq_detach(priv->irqtxi);
  irq_detach(priv->irqeri);

  return ret;
}

/****************************************************************************
 * Name: ra6m5serial_detach
 *
 * Description:
 *   Detach SCI interrupts.  This method is called when the serial port is
 *   closed normally just before the shutdown method is called.  The
 *   exception is the serial console which is never shutdown.
 *
 ****************************************************************************/

static void ra6m5serial_detach(struct uart_dev_s *dev)
{
  struct ra6m5_serial_s *priv =
    (struct ra6m5_serial_s *)dev->priv;
  
  up_disable_irq(priv->irqrxi);
  up_disable_irq(priv->irqtxi);
  up_disable_irq(priv->irqtei);
  up_disable_irq(priv->irqeri);

  irq_detach(priv->irqrxi);
  irq_detach(priv->irqtxi);
  irq_detach(priv->irqtei);
  irq_detach(priv->irqeri);
}

/****************************************************************************
 * Name: ra6m5serial_interrupt
 *
 * Description:
 *   This is the SCI interrupt handler.  It will be invoked when an
 *   interrupt is received on the 'irq'.  It should call uart_xmitchars or
 *   uart_recvchars to perform the appropriate data transfers.  The
 *   interrupt handling logic must be able to map the 'arg' to the
 *   appropriate uart_dev_s structure in order to call these functions.
 *
 ****************************************************************************/

static int ra6m5serial_interrupt(int irq, void *context, void *arg)
{
  struct ra6m5_serial_s *priv = (struct ra6m5_serial_s *)arg;
  int  passes;
  bool handled;

  DEBUGASSERT(priv != NULL);

  /* Report serial activity to the power management logic */

#if defined(CONFIG_PM) && CONFIG_RA6M5_PM_SERIAL_ACTIVITY > 0
  pm_activity(PM_IDLE_DOMAIN, CONFIG_RA6M5_PM_SERIAL_ACTIVITY);
#endif

  /* Loop until there are no characters to be transferred or,
   * until we have been looping for a long time.
   */

  handled = true;
  for (passes = 0; passes < 256 && handled; passes++)
    {
      handled = false;

