gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_serial.c
      /* Get the masked SCI status word. */

      priv->sr = ra6m5serial_getreg8(priv, RA6M5_SCI_SSR_OFFSET);

      /* SCI interrupts:
       *
       * Enable           Status          Meaning
       * ---------------- -------------- ----------------------
       * SCI_SCR_RIE      SCI_SSR_RDRF    Received Data Full
       * SCI_SCR_TIE      SCI_SSR_TDRE    Transmit Data Empty
       * SCI_SCR_TEIE     SCI_SSR_TEND    Transmission End  (only RS-485)
       * 
       */

#ifdef HAVE_RS485
      /* Transmission of whole buffer is over - TC is set, TXEIE is cleared.
       * Note - this should be first, to have the most recent TC bit value
       * from SR register - sending data affects TC, but without refresh we
       * will not know that...
       */

      if ((priv->sr & SCI_SSR_TEND) != 0 &&
          (priv->ie & SCI_SCR_TEIE) != 0 &&
          (priv->ie & SCI_SCR_TIE) == 0)
        {
          ra6m5_gpiowrite(priv->rs485_dir_gpio, !priv->rs485_dir_polarity);
          ra6m5serial_restoreusartint(priv, priv->ie & ~SCI_SCR_TEIE);
        }
#endif

      /* Handle incoming, receive bytes. */

      if ((priv->sr & SCI_SSR_RDRF) != 0 &&
          (priv->ie & SCI_SCR_RIE) != 0)
        {
          /* Received data ready... process incoming bytes.  NOTE the check
           * for RDRF:  We cannot call uart_recvchards of RX interrupts are
           * disabled.
           */

          uart_recvchars(&priv->dev);
          handled = true;
        }

      /* We may still have to read from the DR register to clear any pending
       * error conditions.
       */

      else if ((priv->sr & (SCI_SSR_ORER | SCI_SSR_PER | SCI_SSR_FER))
               != 0)
        {
          /* These errors are cleared by writing "0" the corresponding 
           * bit to the Serial Status Register (SSR).
           */

          ra6m5serial_putreg8(priv, RA6M5_SCI_SSR_OFFSET,
                              ~(SCI_SSR_ORER | SCI_SSR_PER | SCI_SSR_FER));
        }

      /* Handle outgoing, transmit bytes */

      if ((priv->sr & SCI_SSR_TDRE) != 0 &&
          (priv->ie & SCI_SCR_TIE) != 0)
        {
          /* Transmit data register empty ... process outgoing bytes */

          uart_xmitchars(&priv->dev);
          handled = true;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: ra6m5serial_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method
 *
 ****************************************************************************/

static int ra6m5serial_ioctl(struct file *filep, int cmd,
                             unsigned long arg)
{
#if defined(CONFIG_SERIAL_TERMIOS) || defined(CONFIG_SERIAL_TIOCSERGSTRUCT)
  struct inode      *inode = filep->f_inode;
  struct uart_dev_s *dev   = inode->i_private;
#endif
#if defined(CONFIG_SERIAL_TERMIOS)
  struct ra6m5_serial_s *priv =
    (struct ra6m5_serial_s *)dev->priv;
#endif
  int                ret    = OK;

  switch (cmd)
    {
#ifdef CONFIG_SERIAL_TIOCSERGSTRUCT
    case TIOCSERGSTRUCT:
      {
        struct ra6m5_serial_s *user;

        user = (struct ra6m5_serial_s *)arg;

        if (!user)
          {
            ret = -EINVAL;
          }
        else
          {
            memcpy(user, dev, sizeof(struct ra6m5_serial_s));
          }
      }
      break;
#endif

#ifdef CONFIG_RA6M5_SCI_SINGLEWIRE
    case TIOCSSINGLEWIRE:
      {
        uint32_t cr1;
        uint32_t cr1_ue;
        irqstate_t flags;

        flags = enter_critical_section();

        /* Get the original state of UE */

        cr1    = ra6m5serial_getreg8(priv, STM32_RA6M5_CR1_OFFSET);
        cr1_ue = cr1 & RA6M5_CR1_UE;
        cr1   &= ~RA6M5_CR1_UE;

        /* Disable UE, HDSEL can only be written when UE=0 */

        ra6m5serial_putreg8(priv, STM32_RA6M5_CR1_OFFSET, cr1);

        /* Change the TX port to be open-drain/push-pull and enable/disable
         * half-duplex mode.
         */

        uint32_t cr = ra6m5serial_getreg8(priv, STM32_RA6M5_CR3_OFFSET);

        if ((arg & SER_SINGLEWIRE_ENABLED) != 0)
          {
            uint32_t gpio_val = GPIO_OPENDRAIN;

            if ((arg & SER_SINGLEWIRE_PULL_MASK) == SER_SINGLEWIRE_PULLUP)
              {
                gpio_val |= GPIO_PULLUP;
              }
            else
              {
                gpio_val |= GPIO_FLOAT;
              }

            if ((arg & SER_SINGLEWIRE_PULL_MASK) == SER_SINGLEWIRE_PULLDOWN)
              {
                gpio_val |= GPIO_PULLDOWN;
              }
            else
              {
                gpio_val |= GPIO_FLOAT;
              }

            ra6m5_configgpio((priv->tx_gpio &
                                ~(GPIO_PUPD_MASK | GPIO_OPENDRAIN)) |
                               gpio_val);

            cr |= RA6M5_CR3_HDSEL;
          }
        else
          {
            ra6m5_configgpio((priv->tx_gpio &
                                ~(GPIO_PUPD_MASK | GPIO_OPENDRAIN)) |
                               GPIO_PUSHPULL);
            cr &= ~RA6M5_CR3_HDSEL;
          }

        ra6m5serial_putreg8(priv, STM32_RA6M5_CR3_OFFSET, cr);

        /* Re-enable UE if appropriate */

        ra6m5serial_putreg8(priv, STM32_RA6M5_CR1_OFFSET, cr1 | cr1_ue);
        leave_critical_section(flags);
      }
     break;
#endif

#ifdef CONFIG_RA6M5_RA6M5_INVERT
    case TIOCSINVERT:
      {
        uint8_t scr;
        uint8_t scr_en;
        irqstate_t flags;

        flags = enter_critical_section();

        /* Get the original state of TE/RE */

        scr    = ra6m5serial_getreg8(priv, RA6M5_SCI_SCR_OFFSET);
        scr_en = scr & 0x30;
        scr   &= ~0x30;

        /* Disable TE,RE, {R,T}XINV can only be written when TE=RE=0 */

        ra6m5serial_putreg8(priv, RA6M5_SCI_SCR_OFFSET, scr);

        /* Enable/disable signal inversion. */

        uint8_t sptr = ra6m5serial_getreg8(priv, RA6M5_SCI_SPTR_OFFSET);

        if (arg & SER_INVERT_ENABLED_RX)
          {
            sptr |= SCI_SPTR_RINV;
          }
        else
          {
            sptr &= ~SCI_SPTR_RINV;
          }

        if (arg & SER_INVERT_ENABLED_TX)
          {
            sptr |= SCI_SPTR_TINV;
          }
        else
          {
            sptr &= ~SCI_SPTR_TINV;
          }

        ra6m5serial_putreg8(priv, RA6M5_SCI_SPTR_OFFSET, sptr);

