gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_serial.c
        /* Re-enable TE/RE if appropriate */

        ra6m5serial_putreg8(priv, RA6M5_SCI_SCR_OFFSET, scr | scr_en);
        leave_critical_section(flags);
      }
     break;
#endif

#ifdef CONFIG_RA6M5_RA6M5_SWAP
    case TIOCSSWAP:
      {
        uint8_t scr;
        uint8_t scr_en;
        irqstate_t flags;

        flags = enter_critical_section();

        /* Get the original state of TE/RE */

        scr    = ra6m5serial_getreg8(priv, RA6M5_SCI_SCR_OFFSET);
        scr_en = scr & 0x30;
        scr   &= ~0x30;

        /* Disable TE/RE, SWAP can only be written when TE=RE=0 */

        ra6m5serial_putreg8(priv, RA6M5_SCI_SCR_OFFSET, scr);

        /* Enable/disable Swap mode. */

        //uint32_t cr = ra6m5serial_getreg8(priv, STM32_RA6M5_CR2_OFFSET);

        if (arg == SER_SWAP_ENABLED)
          {

          }
        else
          {

          }

        //ra6m5serial_putreg8(priv, STM32_RA6M5_CR2_OFFSET, cr);

        /* Re-enable TE/RE if appropriate */

        ra6m5serial_putreg8(priv, RA6M5_SCI_SCR_OFFSET, scr | scr_en);
        leave_critical_section(flags);
      }
     break;
#endif

#ifdef CONFIG_SERIAL_TERMIOS
    case TCGETS:
      {
        struct termios *termiosp = (struct termios *)arg;

        if (!termiosp)
          {
            ret = -EINVAL;
            break;
          }

        cfsetispeed(termiosp, priv->baud);

        /* Note that since we only support 8/9 bit modes and
         * there is no way to report 9-bit mode, we always claim 8.
         */

        termiosp->c_cflag =
          ((priv->parity != 0) ? PARENB : 0) |
          ((priv->parity == 1) ? PARODD : 0) |
          ((priv->stopbits2) ? CSTOPB : 0) |
#ifdef CONFIG_SERIAL_OFLOWCONTROL
          ((priv->oflow) ? CCTS_OFLOW : 0) |
#endif
#ifdef CONFIG_SERIAL_IFLOWCONTROL
          ((priv->iflow) ? CRTS_IFLOW : 0) |
#endif
          CS8;

        /* TODO: CRTS_IFLOW, CCTS_OFLOW */
      }
      break;

    case TCSETS:
      {
        struct termios *termiosp = (struct termios *)arg;

        if (!termiosp)
          {
            ret = -EINVAL;
            break;
          }

        /* Perform some sanity checks before accepting any changes */

        if (((termiosp->c_cflag & CSIZE) != CS8)
#ifdef CONFIG_SERIAL_OFLOWCONTROL
            || ((termiosp->c_cflag & CCTS_OFLOW) && (priv->cts_gpio == 0))
#endif
#ifdef CONFIG_SERIAL_IFLOWCONTROL
            || ((termiosp->c_cflag & CRTS_IFLOW) && (priv->rts_gpio == 0))
#endif
           )
          {
            ret = -EINVAL;
            break;
          }

        if (termiosp->c_cflag & PARENB)
          {
            priv->parity = (termiosp->c_cflag & PARODD) ? 1 : 2;
          }
        else
          {
            priv->parity = 0;
          }

        priv->stopbits2 = (termiosp->c_cflag & CSTOPB) != 0;
#ifdef CONFIG_SERIAL_OFLOWCONTROL
        priv->oflow = (termiosp->c_cflag & CCTS_OFLOW) != 0;
#endif
#ifdef CONFIG_SERIAL_IFLOWCONTROL
        priv->iflow = (termiosp->c_cflag & CRTS_IFLOW) != 0;
#endif

        /* Note that since there is no way to request 9-bit mode
         * and no way to support 5/6/7-bit modes, we ignore them
         * all here.
         */

        /* Note that only cfgetispeed is used because we have knowledge
         * that only one speed is supported.
         */

        priv->baud = cfgetispeed(termiosp);

        /* Effect the changes immediately - note that we do not implement
         * TCSADRAIN / TCSAFLUSH
         */

        ra6m5serial_setformat(dev);
      }
      break;
#endif /* CONFIG_SERIAL_TERMIOS */

#ifdef CONFIG_RA6M5_RA6M5_BREAKS
#  ifdef CONFIG_RA6M5_SERIALBRK_BSDCOMPAT
    case TIOCSBRK:  /* BSD compatibility: Turn break on, unconditionally */
      {
        irqstate_t flags;
        uint32_t tx_break;

        flags = enter_critical_section();

        /* Disable any further tx activity */

        priv->ie |= RA6M5_CR1_IE_BREAK_INPROGRESS;

        ra6m5serial_txint(dev, false);

        /* Configure TX as a GPIO output pin and Send a break signal */

        tx_break = GPIO_OUTPUT |
                   (~(GPIO_MODE_MASK | GPIO_OUTPUT_SET) & priv->tx_gpio);
        ra6m5_configgpio(tx_break);

        leave_critical_section(flags);
      }
      break;

    case TIOCCBRK:  /* BSD compatibility: Turn break off, unconditionally */
      {
        irqstate_t flags;

        flags = enter_critical_section();

        /* Configure TX back to U(S)ART */

        ra6m5_configgpio(priv->tx_gpio);

        priv->ie &= ~RA6M5_CR1_IE_BREAK_INPROGRESS;

        /* Enable further tx activity */

        ra6m5serial_txint(dev, true);

        leave_critical_section(flags);
      }
      break;
#  else
    case TIOCSBRK:  /* No BSD compatibility: Turn break on for M bit times */
      {
        uint32_t cr1;
        irqstate_t flags;

        flags = enter_critical_section();
        cr1   = ra6m5serial_getreg8(priv, STM32_RA6M5_CR1_OFFSET);
        ra6m5serial_putreg8(priv, STM32_RA6M5_CR1_OFFSET,
                             cr1 | RA6M5_CR1_SBK);
        leave_critical_section(flags);
      }
      break;

    case TIOCCBRK:  /* No BSD compatibility: May turn off break too soon */
      {
        uint32_t cr1;
        irqstate_t flags;

        flags = enter_critical_section();
        cr1   = ra6m5serial_getreg8(priv, STM32_RA6M5_CR1_OFFSET);
        ra6m5serial_putreg8(priv, STM32_RA6M5_CR1_OFFSET,
                             cr1 & ~RA6M5_CR1_SBK);
        leave_critical_section(flags);
      }
      break;
#  endif
#endif

    default:
      ret = -ENOTTY;
      break;
    }

  return ret;
}

/****************************************************************************
 * Name: ra6m5serial_receive
 *
 * Description:
 *   Called (usually) from the interrupt level to receive one
 *   character from the SCI.  Error bits associated with the
 *   receipt are provided in the return 'status'.
 *
 ****************************************************************************/

#ifndef SERIAL_HAVE_ONLY_DMA
static int ra6m5serial_receive(struct uart_dev_s *dev,
                               unsigned int *status)
{
  struct ra6m5_serial_s *priv =
    (struct ra6m5_serial_s *)dev->priv;
  uint8_t rdr;

