gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_serial.c
  /* Reset our DMA shadow pointer to match the address just
   * programmed above.
   */

  priv->rxdmanext = 0;

#ifdef CONFIG_SERIAL_IFLOWCONTROL
  if (priv->iflow)
    {
      /* Start the DMA channel, and arrange for callbacks at the full point
       * in the FIFO. After buffer gets full, hardware flow-control kicks
       * in and DMA transfer is stopped.
       */

      ra6m5_dmastart(priv->rxdma, ra6m5serial_dmarxcallback,
                      (void *)priv, false);
    }
  else
#endif
    {
      /* Start the DMA channel, and arrange for callbacks at the half and
       * full points in the FIFO.  This ensures that we have half a FIFO
       * worth of time to claim bytes before they are overwritten.
       */

      ra6m5_dmastart(priv->rxdma, ra6m5serial_dmarxcallback,
                      (void *)priv, true);
    }

#ifdef CONFIG_PM
  /* Clear DMA suspended flag. */

  priv->rxdmasusp = false;
#endif
}
#endif

/****************************************************************************
 * Name: ra6m5serial_dmaiflowrestart
 *
 * Description:
 *   Call to restart RX DMA for input flow-controlled SCI
 *
 ****************************************************************************/

#if defined(SERIAL_HAVE_DMA) && defined(CONFIG_SERIAL_IFLOWCONTROL)
static bool ra6m5serial_dmaiflowrestart(struct ra6m5_serial_s *priv)
{
  if (!priv->rxenable)
    {
      /* Rx not enabled by upper layer. */

      return false;
    }

  if (priv->rxdmanext != RXDMA_BUFFER_SIZE)
    {
#ifdef CONFIG_PM
      if (priv->rxdmasusp)
        {
          /* Rx DMA in suspended state. */

          if (ra6m5serial_dmarxavailable(&priv->dev))
            {
              /* DMA buffer has unprocessed data, do not re-enable yet. */

              return false;
            }
        }
      else
#endif
        {
          return false;
        }
    }

  /* DMA is stopped or suspended and DMA buffer does not have pending data,
   * re-enabling without data loss is now safe.
   */

  ra6m5serial_dmareenable(priv);

  return true;
}
#endif

/****************************************************************************
 * Name: ra6m5serial_dmarxint
 *
 * Description:
 *   Call to enable or disable RX interrupts
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_DMA
static void ra6m5serial_dmarxint(struct uart_dev_s *dev, bool enable)
{
  struct ra6m5_serial_s *priv =
    (struct ra6m5_serial_s *)dev->priv;

  /* En/disable DMA reception.
   *
   * Note that it is not safe to check for available bytes and immediately
   * pass them to uart_recvchars as that could potentially recurse back
   * to us again.  Instead, bytes must wait until the next up_dma_poll or
   * DMA event.
   */

  priv->rxenable = enable;

#ifdef CONFIG_SERIAL_IFLOWCONTROL
  if (priv->iflow)
    {
      /* Re-enable RX DMA. */

      ra6m5serial_dmaiflowrestart(priv);
    }
#endif
}
#endif

/****************************************************************************
 * Name: ra6m5serial_dmarxavailable
 *
 * Description:
 *   Return true if the receive register is not empty
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_DMA
static bool ra6m5serial_dmarxavailable(struct uart_dev_s *dev)
{
  struct ra6m5_serial_s *priv =
    (struct ra6m5_serial_s *)dev->priv;

  /* Compare our receive pointer to the current DMA pointer, if they
   * do not match, then there are bytes to be received.
   */

  return (ra6m5serial_dmanextrx(priv) != priv->rxdmanext);
}
#endif

/****************************************************************************
 * Name: ra6m5serial_send
 *
 * Description:
 *   This method will send one byte on the SCI
 *
 ****************************************************************************/

static void ra6m5serial_send(struct uart_dev_s *dev, int ch)
{
  struct ra6m5_serial_s *priv =
    (struct ra6m5_serial_s *)dev->priv;

#ifdef HAVE_RS485
  if (priv->rs485_dir_gpio != 0)
    {
      ra6m5_gpiowrite(priv->rs485_dir_gpio, priv->rs485_dir_polarity);
    }
#endif

  ra6m5serial_putreg8(priv, RA6M5_SCI_TDR_OFFSET, (uint8_t)ch);
}

/****************************************************************************
 * Name: ra6m5serial_txint
 *
 * Description:
 *   Call to enable or disable TX interrupts
 *
 ****************************************************************************/

static void ra6m5serial_txint(struct uart_dev_s *dev, bool enable)
{
  struct ra6m5_serial_s *priv =
    (struct ra6m5_serial_s *)dev->priv;
  irqstate_t flags;

  /* SCI transmit interrupts:
   *
   * Enable           Status          Meaning
   * ---------------- -------------- ----------------------
   * SCI_SCR_TIE      SCI_SSR_TDRE    Transmit Data Empty
   * SCI_SCR_TEIE     SCI_SSR_TEND    Transmission End  (only RS-485)
   */

  flags = enter_critical_section();
  if (enable)
    {
      /* Set to receive an interrupt when the TX data register is empty */

#ifndef CONFIG_SUPPRESS_SERIAL_INTS
      uint8_t ie = priv->ie | SCI_SCR_TIE;

      /* If RS-485 is supported on this SCI, then also enable the
       * transmission complete interrupt.
       */

#  ifdef HAVE_RS485
      if (priv->rs485_dir_gpio != 0)
        {
          ie |= SCI_SCR_TEIE;
        }
#  endif

#  ifdef CONFIG_RA6M5_SERIALBRK_BSDCOMPAT
      if (priv->ie & USART_CR1_IE_BREAK_INPROGRESS)
        {
          leave_critical_section(flags);
          return;
        }
#  endif

      ra6m5serial_restoreusartint(priv, ie);

      /* Fake a TX interrupt here by just calling uart_xmitchars() with
       * interrupts disabled (note this may recurse).
       */

      uart_xmitchars(dev);
#endif
    }
  else
    {
      /* Disable the TX interrupt */

      ra6m5serial_restoreusartint(priv, priv->ie & ~SCI_SCR_TIE);
    }

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: ra6m5serial_txready
 *
 * Description:
 *   Return true if the transmit data register is empty
 *
 ****************************************************************************/

