gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_serial.c
          if (priv->dev.recv.head != priv->dev.recv.tail)
            {
              return ERROR;
            }
        }
      break;

    default:

      /* Should not get here */

      break;
    }

  return OK;
}
#endif

#endif /* HAVE_UART */
#endif /* USE_SERIALDRIVER */

/****************************************************************************
 * Public Functions
 ****************************************************************************/

#ifdef USE_SERIALDRIVER

/****************************************************************************
 * Name: arm_earlyserialinit
 *
 * Description:
 *   Performs the low level SCI initialization early in debug so that the
 *   serial console will be available during bootup.  This must be called
 *   before arm_serialinit.
 *
 ****************************************************************************/

#ifdef USE_EARLYSERIALINIT
void arm_earlyserialinit(void)
{
#ifdef HAVE_UART
  unsigned i;

  /* Disable all SCI interrupts */

  for (i = 0; i < RA6M5_NSCI; i++)
    {
      if (g_uart_devs[i])
        {
          ra6m5serial_disableusartint(g_uart_devs[i], NULL);
        }
    }

  /* Configure whichever one is the console */

#ifdef CONSOLE_UART
  ra6m5serial_setup(&g_uart_devs[CONSOLE_UART]->dev);
#endif
#endif /* HAVE UART */
}
#endif /* USE_EARLYSERIALINIT */

/****************************************************************************
 * Name: arm_serialinit
 *
 * Description:
 *   Register serial console and serial ports.  This assumes
 *   that arm_earlyserialinit was called previously.
 *
 ****************************************************************************/

void arm_serialinit(void)
{
#ifdef HAVE_UART
  char devname[16];
  unsigned i;
  unsigned minor = 0;
#ifdef CONFIG_PM
  int ret;
#endif

  /* Register to receive power management callbacks */

#ifdef CONFIG_PM
  ret = pm_register(&g_serialpm.pm_cb);
  DEBUGASSERT(ret == OK);
  UNUSED(ret);
#endif

  /* Register the console */

#ifdef CONSOLE_UART
  uart_register("/dev/console", &g_uart_devs[CONSOLE_UART]->dev);

#ifndef CONFIG_RA6M5_SERIAL_DISABLE_REORDERING
  /* If not disabled, register the console UART to ttyS0 and exclude
   * it from initializing it further down
   */

  uart_register("/dev/ttyS0", &g_uart_devs[CONSOLE_UART]->dev);
  minor = 1;
#endif

#ifdef SERIAL_HAVE_CONSOLE_DMA
  /* If we need to re-initialise the console to enable DMA do that here. */

  ra6m5serial_dmasetup(&g_uart_devs[CONSOLE_UART]->dev);
#endif
#endif /* CONSOLE_UART */

  /* Register all remaining SCIs */

  strlcpy(devname, "/dev/ttySx", sizeof(devname));

  for (i = 0; i < RA6M5_NSCI; i++)
    {
      /* Don't create a device for non-configured ports. */

      if (g_uart_devs[i] == 0)
        {
          continue;
        }

#ifndef CONFIG_RA6M5_SERIAL_DISABLE_REORDERING
      /* Don't create a device for the console - we did that above */

      if (g_uart_devs[i]->dev.isconsole)
        {
          continue;
        }
#endif

      /* Register SCIs as devices in increasing order */

      devname[9] = '0' + minor++;
      uart_register(devname, &g_uart_devs[i]->dev);
    }
#endif /* HAVE UART */
}

/****************************************************************************
 * Name: ra6m5_serial_dma_poll
 *
 * Description:
 *   Checks receive DMA buffers for received bytes that have not accumulated
 *   to the point where the DMA half/full interrupt has triggered.
 *
 *   This function should be called from a timer or other periodic context.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_DMA
void ra6m5_serial_dma_poll(void)
{
    irqstate_t flags;

    flags = enter_critical_section();

#ifdef CONFIG_LPUART1_RXDMA
  if (g_lpuart1priv.rxdma != NULL)
    {
      ra6m5serial_dmarxcallback(g_lpuart1priv.rxdma, 0, &g_lpuart1priv);
    }
#endif

#ifdef CONFIG_SCI0_RXDMA
  if (g_sci0priv.rxdma != NULL)
    {
      ra6m5serial_dmarxcallback(g_sci0priv.rxdma, 0, &g_sci0priv);
    }
#endif

#ifdef CONFIG_SCI1_RXDMA
  if (g_sci1priv.rxdma != NULL)
    {
      ra6m5serial_dmarxcallback(g_sci1priv.rxdma, 0, &g_sci1priv);
    }
#endif

#ifdef CONFIG_SCI2_RXDMA
  if (g_sci2priv.rxdma != NULL)
    {
      ra6m5serial_dmarxcallback(g_sci2priv.rxdma, 0, &g_sci2priv);
    }
#endif

#ifdef CONFIG_SCI3_RXDMA
  if (g_sci3priv.rxdma != NULL)
    {
      ra6m5serial_dmarxcallback(g_sci3priv.rxdma, 0, &g_sci3priv);
    }
#endif

#ifdef CONFIG_SCI4_RXDMA
  if (g_sci4priv.rxdma != NULL)
    {
      ra6m5serial_dmarxcallback(g_sci4priv.rxdma, 0, &g_sci4priv);
    }
#endif

  leave_critical_section(flags);
}
#endif

/****************************************************************************
 * Name: up_putc
 *
 * Description:
 *   Provide priority, low-level access to support OS debug writes
 *
 ****************************************************************************/

int up_putc(int ch)
{
#ifdef CONSOLE_UART
  struct ra6m5_serial_s *priv = g_uart_devs[CONSOLE_UART];
  uint8_t ie;

  ra6m5serial_disableusartint(priv, &ie);

  /* Check for LF */

  if (ch == '\n')
    {
      /* Add CR */

      arm_lowputc('\r');
    }

  arm_lowputc(ch);
  ra6m5serial_restoreusartint(priv, ie);
#endif
  return ch;
}

#else /* USE_SERIALDRIVER */

/****************************************************************************
 * Name: up_putc
 *
 * Description:
 *   Provide priority, low-level access to support OS debug writes
 *
 ****************************************************************************/

int up_putc(int ch)
{
#ifdef CONSOLE_UART
  /* Check for LF */

  if (ch == '\n')
    {
      /* Add CR */

      arm_lowputc('\r');
    }

  arm_lowputc(ch);
#endif
  return ch;
}

#endif /* USE_SERIALDRIVER */
